## 01. 엑셀에서 데이터프레임 불러오기

In [1]:
import pandas as pd

In [2]:
url = "/Users/mac/Documents/Mac mini/Python/1. 학습/1. 파이썬으로 할 수 있는 모든것/5. 데이터 분석 및 시각화/0. 강의자료/CH2_Excel file/02_01_read_excel.xlsx"

In [3]:
df = pd.read_excel(url)

In [4]:
df

    이름  국어  영어  수학
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [38]:
pd.read_excel(url, sheet_name= 1)

     두   번   째  시트
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [5]:
pd.read_excel(url, sheet_name = 2, header = 2)

    이름  국어  영어  수학
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [40]:
pd.read_excel(url, sheet_name = 2, header = 2)

    이름  국어  영어  수학
0  송중기  63  93  97
1  김나현  89  83  71
2  권보아  83  76  92
3  박효신  94  88  73

In [41]:
pd.read_excel(url, sheet_name=3)

  Unnamed: 0  국어  영어  수학
0        송중기  63  93  97
1        김나현  89  83  71
2        권보아  83  76  92
3        박효신  94  88  73

In [42]:
pd.read_excel(url, sheet_name=2, header=2, index_col=0)

     국어  영어  수학
이름
송중기  63  93  97
김나현  89  83  71
권보아  83  76  92
박효신  94  88  73

## 02. 단일요건 vlookup

In [43]:
import pandas as pd

In [6]:
url = "/Users/mac/Documents/Mac mini/Python/1. 학습/1. 파이썬으로 할 수 있는 모든것/5. 데이터 분석 및 시각화/0. 강의자료/CH2_Excel file/02_02_merge01.xlsx"
df = pd.read_excel(url)

In [7]:
df

      이름     제품
0    백철민   아이스티
1    박태인  레몬에이드
2    국지용  아메리카노
3    강민석  레몬에이드
4    박훈정   아이스티
..   ...    ...
369  김경남  아메리카노
370  기정수    유자차
371  기주봉   아이스티
372  백승환  바닐라라떼
373  계승현  레몬에이드

[374 rows x 2 columns]

In [52]:
pd.set_option('display.max_rows', 6)

In [53]:
pd.read_excel(url)

      이름     제품
0    백철민   아이스티
1    박태인  레몬에이드
2    국지용  아메리카노
..   ...    ...
371  기주봉   아이스티
372  백승환  바닐라라떼
373  계승현  레몬에이드

[374 rows x 2 columns]

In [8]:
df1 = pd.read_excel(url, sheet_name=0)
df2 = pd.read_excel(url, sheet_name=1)

In [9]:
df3 = df1.merge(df2, how='left', on='제품')

In [10]:
df3

      이름     제품    가격
0    백철민   아이스티  4400
1    박태인  레몬에이드  4400
2    국지용  아메리카노  3900
3    강민석  레몬에이드  4400
4    박훈정   아이스티  4400
..   ...    ...   ...
369  김경남  아메리카노  3900
370  기정수    유자차  3500
371  기주봉   아이스티  4400
372  백승환  바닐라라떼  3900
373  계승현  레몬에이드  4400

[374 rows x 3 columns]

In [65]:
df3.to_excel("merge_result.xlsx", index=False)

## 03. 다중요건 vlookup

In [71]:
url = "/Users/mac/Documents/Mac mini/Python/1. 학습/1. 파이썬으로 할 수 있는 모든것/5. 데이터 분석 및 시각화/0. 강의자료/CH2_Excel file/02_03_merge02.xlsx"
df1 = pd.read_excel(url, sheet_name=0)
df2 = pd.read_excel(url, sheet_name=1)

In [75]:
df3 = df1.merge(df2, how='inner').to_excel("merge_result2.xlsx", index=False)

In [74]:
df3

      이름     제품     업체    가격  구분
0     백민  산채비빔밥  종가도시락  6700  한식
1    권상우  치킨도시락  두솥도시락  6300  한식
2    강인서  돈까스정식  두솥도시락  5700  일식
..   ...    ...    ...   ...  ..
371  백철민  돈까스정식  두솥도시락  5700  일식
372  김두진  산채비빔밥  종가도시락  6700  한식
373  김동수  돈까스정식  두솥도시락  5700  일식

[374 rows x 5 columns]

## 04. 행과 열의 이름 바꾸기

In [23]:
import pandas as pd
pd.set_option('display.max_rows', 6)
data1 = [['송중기', '별다방', '아이스티'],
         ['김나현', '콩다방', '카페오레'],
         ['권보아', '별다방', '카페오레'],
         ['박효신', '콩다방', '아이스티'],
         ['김범수', '별다방', '카페오레']]
data2 = [['별다방', '아이스티', 4500],
         ['별다방', '카페오레', 4000],
         ['콩다방', '아이스티', 6000],
         ['콩다방', '카페오레', 5500]]
df1 = pd.DataFrame(data1, columns=['이름', '업체', '음료'])
df2 = pd.DataFrame(data2, columns=['업체', '제품', '가격'])

In [24]:
df2 = df2.rename(columns={'제품':'음료'})

In [25]:
df2

    업체    음료    가격
0  별다방  아이스티  4500
1  별다방  카페오레  4000
2  콩다방  아이스티  6000
3  콩다방  카페오레  5500

In [26]:
df2.rename(columns={'제품':'음료'}, inplace=True)

In [27]:
df2

    업체    음료    가격
0  별다방  아이스티  4500
1  별다방  카페오레  4000
2  콩다방  아이스티  6000
3  콩다방  카페오레  5500

In [84]:
df1.merge(df2.rename(columns={'제품':'음료'}), how='left')

    이름   업체    음료    가격
0  송중기  별다방  아이스티  4500
1  김나현  콩다방  카페오레  5500
2  권보아  별다방  카페오레  4000
3  박효신  콩다방  아이스티  6000
4  김범수  별다방  카페오레  4000

## 05. 정렬하기

In [1]:
import pandas as pd

In [6]:
data = [[92],
        [75],
        [88],
        [62]]

In [7]:
idx = ['송중기', '김나현', '권보아', '박효신']

In [8]:
pd.DataFrame(data, index=idx, columns=['점수'])

     점수
송중기  92
김나현  75
권보아  88
박효신  62

In [43]:
data1 = [['송중기'],
         ['김나현'],
         ['권보아'],
         ['박효신']]
data2 = [[92],
         [75],
         [88],
         [62]]

In [4]:
pd.DataFrame(data1, columns=['이름']).merge(pd.DataFrame(data2, columns=['점수']), left_index=True, right_index=True)

    이름  점수
0  송중기  92
1  김나현  75
2  권보아  88
3  박효신  62

In [36]:
data_idx = ['a', 'b', 'c', 'd']

In [39]:
pd.DataFrame(data = data2, index=data1, columns=['이름'])

ValueError: Length of values (4) does not match length of index (1)

In [41]:
type(data1[0])

list

In [48]:
type(data2[0])

list

In [35]:
pd.DataFrame(data2, index='a, b, c, d'.split(', '), columns=['점수'])

   점수
a  92
b  75
c  88
d  62

In [1]:
import pandas as pd

In [9]:
data1 = ['송중기', '백종원', '이효리']
data2 = [92, 85, 78]

In [10]:
pd.Series(data1, name='이름').to_frame().merge(pd.Series(data2, name='점수').to_frame(), left_index=True, right_index=True)

    이름  점수
0  송중기  92
1  백종원  85
2  이효리  78

## 06. 범위로 vlookup 하기

In [5]:
import pandas as pd

In [8]:
data1 = ['라', '나', '다', '가', '마']
data2 = [60, 72, 80, 88, 95]

a = pd.DataFrame(data1 , columns=['이름'])
b = pd.DataFrame(data2 , columns=['점수'])

In [10]:
b

   점수
0  60
1  72
2  80
3  88
4  95

In [12]:
df1 = pd.merge(a, b, left_index=True, right_index=True)

In [13]:
df1

  이름  점수
0  라  60
1  나  72
2  다  80
3  가  88
4  마  95

In [14]:
data3 = [0, 70, 80, 90]
data4 = ['F', 'C', 'B', 'A']

df2 = pd.DataFrame(data3 , columns=['점수']).merge(pd.DataFrame(data4 , columns=['학점']), left_index=True, right_index=True)

In [15]:
df2

   점수 학점
0   0  F
1  70  C
2  80  B
3  90  A

In [21]:
df3 = pd.merge_asof(df1, df2, on='점수', direction='backward')

In [29]:
df3['점수'] > 80

0    False
1    False
2    False
3     True
4     True
Name: 점수, dtype: bool

In [1]:
import pandas as pd
pd.set_option('display.max_rows', 6)
data1 = [['가', 88], ['나', 72], ['다', 80], ['라', 60], ['마', 95]]
data2 = [[90, 'A'], [80, 'B'], [70, 'C'], [0, 'F']]
df1 = pd.DataFrame(data1, columns=['이름', '점수'])
df2 = pd.DataFrame(data2, columns=['점수', '학점'])
df2

   점수 학점
0  90  A
1  80  B
2  70  C
3   0  F

In [ ]:
a = df1.sort_values(by='점수')
b = df2.sort_values(by='점수', ascending=True)

In [38]:
b

   점수 학점
3   0  F
2  70  C
1  80  B
0  90  A

In [39]:
pd.merge_asof(a, b, on='점수', direction='backward')

  이름  점수 학점
0  라  60  F
1  나  72  C
2  다  80  B
3  가  88  B
4  마  95  A

In [4]:
url = "/Users/mac/Documents/Mac mini/Python/1. 학습/1. 파이썬으로 할 수 있는 모든것/5. 데이터 분석 및 시각화/0. 강의자료/CH2_Excel file/02_06_merge_asof.xlsx"

data1 = pd.read_excel(url, sheet_name=0)
data2 = pd.read_excel(url, sheet_name=1).sort_values(by='수량', ascending=True)

In [7]:
data1

   사이즈   종류   수량
0   A3  풀컬러   10
1   A4   컬러   10
2   A4  풀컬러   29
..  ..  ...  ...
97  A4   컬러  962
98  B5   컬러  973
99  A4  풀컬러  975

[100 rows x 3 columns]

In [5]:
data2

   사이즈   종류    수량   단가
0   A4   컬러     1  100
19  B5  풀컬러     1  160
14  B5   컬러     1   80
..  ..  ...   ...  ...
22  B5  풀컬러   500   80
18  B5   컬러  1000   20
23  B5  풀컬러  1000   50

[24 rows x 4 columns]

In [8]:
data3 = pd.merge_asof(data1, data2, on='수량', by=['사이즈', '종류'], direction='backward')

In [9]:
data3.to_excel("merge_asof_result.xlsx", index=False)